{
  "id": "django-todo-app-first-impressions",
  "title": "Django To-Do App First Impressions: Module 1 at AI Dev Tools Zoomcamp",
  "slug": "django-todo-app-first-impressions",
  "excerpt": "Building my first Django app with zero prior experience, using AI tools to scaffold a working TODO app in 10 minutes, experimenting with custom interfaces, and learning by reverse-engineering the generated code.",
  "content": "I [decided to join AI DevTools Zoomcamp](/blog/do-i-use-ai) and was genuinely curious what I'd be able to build.\n\nIn the first module of the course, we build a TODO app using the Django framework.\n\nSide note:\nI knew *nothing* about Django before starting the course.\n\nFor someone who doesn't come from a classic software engineering background, AI tools are a huge unlock. They don't magically make you a senior developer overnight, but they *do* lower the barrier so you can build real projects, see how things work under the hood, and learn by doing.\n\nInsane, but: It took about 10 minutes for Cursor to scaffold a working Django TODO app. I followed the homework instructions, asked the AI to build the project, and watched it piece everything together.\n\nWhile the model was generating code, I tried to reverse-engineer what it was doing:\n\n- Django app structure\n- Component connections\n- File responsibilities\n\nThat alone was a great learning experience.\n\nThen I started experimenting a bit more and created a girly-pixelated version (pushed to the extreme 😂🌸) with a calendar view and repeated tasks. It definitely needs work (the font is unreadable and repeating events don't actually repeat yet). But it was a fun way to explore how far I could push the interface with AI assistance.\n\nOverall, I had a lot of fun with this module!\n\nNot sure if I \"built\" it or \"watched it build itself,\" but both felt equally fascinating.",
  "tags": [
    "AI Tools",
    "Django",
    "Learning",
    "Development",
    "Web Development"
  ],
  "readTime": "2 min read",
  "published": "true",
  "publishedAt": "2025-11-28T00:00:00.000Z",
  "imageUrl": null,
  "createdAt": "2025-11-28T00:00:00.000Z"
}