{
  "metadata": {
    "name": "Valeria Kuka",
    "title": "Content Manager @ DataTalks.Club",
    "email": "kavaivaleri@gmail.com",
    "location": "Spain",
    "linkedin": "https://www.linkedin.com/in/valeriia-kuka",
    "twitter": "https://twitter.com/valeria_kuka"
  },
  "content": "# About\n\nI'm a content manager and technical writer specializing in AI/ML. I write, edit, and grow content to help people learn about machine learning, prompt engineering, and AI safety. I'm curious about how we explain and scale technical knowledge.\n\n## Experience\n\n**Content Manager @ DataTalks.Club** (May 2025 - Present)\n- Leading content strategy across social media, blog, and newsletters\n- Contributed to 7,300 registrations for an upcoming free course in 2 months\n\n**Head of Content @ Learn Prompting** (August 2024 - April 2025)\n- Owned content strategy for docs, blog, newsletter, and social media, driving +98% organic users, +65% sessions, and +25-45pp engagement gains in 9 months\n- Managed 3-5 freelance writers and authored core content\n- Founded the Learn Prompting Newsletter, achieving 35-40% open rates and 4-6% CTR\n- Executed SEO strategy that drove record traffic to /courses/ in March 2025\n- Grew social reach (+12% Twitter, +75% LinkedIn) with new content formats\n\n**Contributing Editor @ TuringPost** (February 2023 - June 2024)\n- Managed end-to-end social media strategy for Twitter and LinkedIn, making them the 3rd-largest subscriber source\n- Growth metrics: Twitter 46K ➡️ 60K (+30%); LinkedIn 2.6K ➡️ 4.6K (+76%)\n- Authored and co-authored technical explainers on Transformers, RAG, Chain-of-Thought, and company profiles\n- Earned recognition when Yann LeCun endorsed my JEPA explainer as an \"excellent blog post\"\n\n**Newsletter Editor @ DataTalksClub** (April 2023 - May 2025)\n- Generated over 5,000 sign-ups for the free MLOps course in 1.5 months through organic channels\n- Revamped sponsorship templates and designed new newsletter templates\n- Achieved LinkedIn growth: 11,273 ➡️ 14,804 followers (+31%), with engagement rate improving from 2.92% to 7.65%\n\n**Social Media Marketing Specialist @ TheSequence** (January 2021 - February 2023)\n- Grew Twitter from 500 to 46,000 followers and LinkedIn from 0 to 2,600 followers\n- Managed multi-channel campaigns and content strategy for technical AI/ML audience\n\n## Research Background\n\n**Research Assistant @ Higher School of Economics** (February 2020 - July 2021)\n- Assisted with research on voting systems and decision-making, working under supervisor guidance\n- Helped develop Python simulations to model group preferences and analyze manipulation effects\n- Contributed to grant-funded research projects supported by the Russian Science Foundation\n- Presented research findings at international conferences (GTM 2020, GTM 2021)\n- Earned 2nd place at the HSE Student Research Competition for bachelor's thesis\n\n## Skills\n\n- Content strategy and planning\n- Technical writing (AI/ML, LLMs, prompt engineering)\n- Social media management and growth (Twitter, LinkedIn)\n- SEO and analytics\n- Newsletter management and email marketing\n- Team coordination and freelance management\n\n## Education\n\n**B.Sc. in Econometrics and Quantitative Economics** from Higher School of Economics (2017-2021)\n\n## Volunteer Experience\n\n**Co-Editor-in-Chief @ Nota Bene Journal** (November 2019 - September 2021)\n- Led student-run publication focused on research and study abroad opportunities at HSE University\n- Managed 5 cross-functional teams (20+ members) including interviewers, editors, and content creators\n- Led project covering work and life in 10+ research and education laboratories\n- Organized alumni panels featuring graduates studying in Russia, Italy, Spain, France, and Germany\n- Conducted thesis preparation workshops connecting senior and junior students\n- Edited 30+ stories including interviews, original content, and research reports\n- Interviewed prominent academics including Eric Maskin and Hervé Moulin\n\n**Editorial Intern @ Nota Bene Journal** (November 2017 - September 2019)\n- Supported editorial operations of student-run publication\n- Transcribed and edited interviews and original content\n- Created social media content to promote journal materials\n\n**Guide @ The F.M. Dostoevsky Literary-Memorial Museum** (September 2019 - September 2020)\n- Volunteered as guide for special museum events\n- Conducted literary exhibition tours during the Night of Museums event\n- Led guided walking tours in Saint Petersburg for Dostoevsky Day celebrations\n\n**Media Specialist @ International Economics Olympiad** (July 2019)\n- Served on media team for international academic competition\n- Developed and executed media plan for event coverage\n- Created content and conducted interviews for the official website\n\n**Conference Volunteer @ Peking University** (December 2020)\n- Supported The 16th Conference on Web and Internet Economics\n- Managed technical setup and testing of speakers' broadcasting environments\n- Facilitated Q&A sessions between presenters and conference attendees\n\n## Languages\n\n- **English**: Fluent\n- **French**: Intermediate"
}